#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KrisCo/Lab-production/runs/run-cuoXTzbZnuujutFu

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_vpc.vpc-practice: Refreshing state... [id=vpc-0fe13b1c9ad4e0057]
aws_internet_gateway.igw-example: Refreshing state... [id=igw-0481ce5cead38ed62]
aws_subnet.public-example-subnet: Refreshing state... [id=subnet-0da9202e1185a5f58]
aws_security_group.webserver-SG: Refreshing state... [id=sg-06734f92b98b0c3f3]
aws_route_table.public-practice-RT: Refreshing state... [id=rtb-0714d49c0bde6692b]
aws_route_table_association.public-access: Refreshing state... [id=rtbassoc-02b10be51dfb63533]
aws_instance.EC2: Refreshing state... [id=i-0ebc41cc456dc149d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.EC2 must be replaced
-/+ resource "aws_instance" "EC2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-0ebc41cc456dc149d" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0ebc41cc456dc149d" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0602205b543e78404" -> (known after apply)
      ~ private_dns                          = "ip-142-55-1-7.ec2.internal" -> (known after apply)
      ~ private_ip                           = "142.55.1.7" -> (known after apply)
      ~ public_dns                           = "ec2-44-203-192-230.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "44.203.192.230" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-06734f92b98b0c3f3",
        ]
        tags                                 = {
            "Name" = "Ec2-terraformed"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-06734f92b98b0c3f3",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-044cd93145a1d33fd" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_vpc.vpc-practice will be updated in-place
  ~ resource "aws_vpc" "vpc-practice" {
        id                                   = "vpc-0fe13b1c9ad4e0057"
      ~ tags                                 = {
          ~ "Name" = "vpc-practice" -> "vpc-production"
        }
      ~ tags_all                             = {
          ~ "Name" = "vpc-practice" -> "vpc-production"
        }
        # (16 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ web-address = "ec2-44-203-192-230.compute-1.amazonaws.com" -> (known after apply)

```

</details>

*Pushed by: @krispigeau, Action: `pull_request`*